; domain
(define (domain Depot)
;(:requirements :typing :fluents)
(:types place locatable - object
		depot distributor - place
        truck hoist surface - locatable
        pallet crate - surface)

(:predicates (at ?x - locatable ?y - place) 
             (on ?x - crate ?y - surface)
             (in ?x - crate ?y - truck)
             (lifting ?x - hoist ?y - crate)
             (available ?x - hoist)
             (clear ?x - surface)
)

(:functions 
	(load_limit ?t - truck) 
	(current_load ?t - truck) 
	(weight ?c - crate)
	(fuel-cost)
)
	
(:action Drive
:parameters (?x - truck ?y - place ?z - place) 
:precondition (and (at ?x ?y))
:effect (and (not (at ?x ?y)) (at ?x ?z)
		(increase (fuel-cost) 10)))

(:action Lift
:parameters (?x - hoist ?y - crate ?z - surface ?p - place)
:precondition (and (at ?x ?p) (available ?x) (at ?y ?p) (on ?y ?z) (clear ?y))
:effect (and (not (at ?y ?p)) (lifting ?x ?y) (not (clear ?y)) (not (available ?x)) 
             (clear ?z) (not (on ?y ?z)) (increase (fuel-cost) 1)))

(:action Drop 
:parameters (?x - hoist ?y - crate ?z - surface ?p - place)
:precondition (and (at ?x ?p) (at ?z ?p) (clear ?z) (lifting ?x ?y))
:effect (and (available ?x) (not (lifting ?x ?y)) (at ?y ?p) (not (clear ?z)) (clear ?y)
		(on ?y ?z)))

(:action Load
:parameters (?x - hoist ?y - crate ?z - truck ?p - place)
:precondition (and (at ?x ?p) (at ?z ?p) (lifting ?x ?y)
		(<= (+ (current_load ?z) (weight ?y)) (load_limit ?z)))
:effect (and (not (lifting ?x ?y)) (in ?y ?z) (available ?x)
		(increase (current_load ?z) (weight ?y))))

(:action Unload 
:parameters (?x - hoist ?y - crate ?z - truck ?p - place)
:precondition (and (at ?x ?p) (at ?z ?p) (available ?x) (in ?y ?z))
:effect (and (not (in ?y ?z)) (not (available ?x)) (lifting ?x ?y)
		(decrease (current_load ?z) (weight ?y))))

)

; problem
(define (problem depotprob34) (:domain depot)
(:objects
	depot0 - depot
	distributor0 distributor1 - distributor
	truck0 truck1 - truck
	pallet0 pallet1 pallet2 - pallet
	crate0 crate1 crate2 crate3 crate4 crate5 - crate
	hoist0 hoist1 hoist2 - hoist)
(:init
	(at pallet0 depot0)
	(clear crate0)
	(at pallet1 distributor0)
	(clear crate4)
	(at pallet2 distributor1)
	(clear crate5)
	(at truck0 distributor1)
	(= (current_load truck0) 0)
	(= (load_limit truck0) 346)
	(at truck1 distributor0)
	(= (current_load truck1) 0)
	(= (load_limit truck1) 246)
	(at hoist0 depot0)
	(available hoist0)
	(at hoist1 distributor0)
	(available hoist1)
	(at hoist2 distributor1)
	(available hoist2)
	(at crate0 depot0)
	(on crate0 pallet0)
	(= (weight crate0) 75)
	(at crate1 distributor0)
	(on crate1 pallet1)
	(= (weight crate1) 7)
	(at crate2 distributor0)
	(on crate2 crate1)
	(= (weight crate2) 57)
	(at crate3 distributor1)
	(on crate3 pallet2)
	(= (weight crate3) 87)
	(at crate4 distributor0)
	(on crate4 crate2)
	(= (weight crate4) 62)
	(at crate5 distributor1)
	(on crate5 crate3)
	(= (weight crate5) 11)
	(= (fuel-cost) 0)
)

(:goal (and
		(on crate0 pallet1)
		(on crate1 crate2)
		(on crate2 crate0)
		(on crate3 crate5)
		(on crate4 crate3)
		(on crate5 pallet2)
	)
)

(:metric minimize (fuel-cost)))

; plan
1. (drive truck0 distributor1 depot0)
   deleted: (at truck0 distributor1)
   added: (at truck0 depot0)
   changed: (fuel-cost) from 0 to 10
   goals met: 0 of 6
2. (lift hoist0 crate0 pallet0 depot0)
   deleted: (at crate0 depot0) (clear crate0) (available hoist0) (on crate0 pallet0)
   added: (lifting hoist0 crate0) (clear pallet0)
   changed: (fuel-cost) from 10 to 11
   goals met: 0 of 6
3. (lift hoist1 crate4 crate2 distributor0)
   deleted: (at crate4 distributor0) (clear crate4) (available hoist1) (on crate4 crate2)
   added: (lifting hoist1 crate4) (clear crate2)
   changed: (fuel-cost) from 11 to 12
   goals met: 0 of 6
4. (load hoist1 crate4 truck1 distributor0)
   deleted: (lifting hoist1 crate4)
   added: (in crate4 truck1) (available hoist1)
   changed: (current_load truck1) from 0 to 62
   goals met: 0 of 6
5. (drive truck1 distributor0 distributor1)
   deleted: (at truck1 distributor0)
   added: (at truck1 distributor1)
   changed: (fuel-cost) from 12 to 22
   goals met: 0 of 6
6. (load hoist0 crate0 truck0 depot0)
   deleted: (lifting hoist0 crate0)
   added: (in crate0 truck0) (available hoist0)
   changed: (current_load truck0) from 0 to 75
   goals met: 0 of 6
7. (drive truck0 depot0 distributor0)
   deleted: (at truck0 depot0)
   added: (at truck0 distributor0)
   changed: (fuel-cost) from 22 to 32
   goals met: 0 of 6
8. (lift hoist1 crate2 crate1 distributor0)
   deleted: (at crate2 distributor0) (clear crate2) (available hoist1) (on crate2 crate1)
   added: (lifting hoist1 crate2) (clear crate1)
   changed: (fuel-cost) from 32 to 33
   goals met: 0 of 6
9. (lift hoist2 crate5 crate3 distributor1)
   deleted: (at crate5 distributor1) (clear crate5) (available hoist2) (on crate5 crate3)
   added: (lifting hoist2 crate5) (clear crate3)
   changed: (fuel-cost) from 33 to 34
   goals met: 0 of 6
10. (load hoist2 crate5 truck1 distributor1)
   deleted: (lifting hoist2 crate5)
   added: (in crate5 truck1) (available hoist2)
   changed: (current_load truck1) from 62 to 73
   goals met: 0 of 6
11. (unload hoist2 crate4 truck1 distributor1)
   deleted: (in crate4 truck1) (available hoist2)
   added: (lifting hoist2 crate4)
   changed: (current_load truck1) from 73 to 11
   goals met: 0 of 6
12. (load hoist1 crate2 truck0 distributor0)
   deleted: (lifting hoist1 crate2)
   added: (in crate2 truck0) (available hoist1)
   changed: (current_load truck0) from 75 to 132
   goals met: 0 of 6
13. (lift hoist1 crate1 pallet1 distributor0)
   deleted: (at crate1 distributor0) (clear crate1) (available hoist1) (on crate1 pallet1)
   added: (lifting hoist1 crate1) (clear pallet1)
   changed: (fuel-cost) from 34 to 35
   goals met: 0 of 6
14. (load hoist1 crate1 truck0 distributor0)
   deleted: (lifting hoist1 crate1)
   added: (in crate1 truck0) (available hoist1)
   changed: (current_load truck0) from 132 to 139
   goals met: 0 of 6
15. (unload hoist1 crate0 truck0 distributor0)
   deleted: (in crate0 truck0) (available hoist1)
   added: (lifting hoist1 crate0)
   changed: (current_load truck0) from 139 to 64
   goals met: 0 of 6
16. (drop hoist1 crate0 pallet1 distributor0)
   deleted: (lifting hoist1 crate0) (clear pallet1)
   added: (available hoist1) (at crate0 distributor0) (clear crate0) (on crate0 pallet1)
   goals met: 1 of 6
17. (unload hoist1 crate2 truck0 distributor0)
   deleted: (in crate2 truck0) (available hoist1)
   added: (lifting hoist1 crate2)
   changed: (current_load truck0) from 64 to 7
   goals met: 1 of 6
18. (drop hoist1 crate2 crate0 distributor0)
   deleted: (lifting hoist1 crate2) (clear crate0)
   added: (available hoist1) (at crate2 distributor0) (clear crate2) (on crate2 crate0)
   goals met: 2 of 6
19. (unload hoist1 crate1 truck0 distributor0)
   deleted: (in crate1 truck0) (available hoist1)
   added: (lifting hoist1 crate1)
   changed: (current_load truck0) from 7 to 0
   goals met: 2 of 6
20. (drop hoist1 crate1 crate2 distributor0)
   deleted: (lifting hoist1 crate1) (clear crate2)
   added: (available hoist1) (at crate1 distributor0) (clear crate1) (on crate1 crate2)
   goals met: 3 of 6
21. (load hoist2 crate4 truck1 distributor1)
   deleted: (lifting hoist2 crate4)
   added: (in crate4 truck1) (available hoist2)
   changed: (current_load truck1) from 11 to 73
   goals met: 3 of 6
22. (lift hoist2 crate3 pallet2 distributor1)
   deleted: (at crate3 distributor1) (clear crate3) (available hoist2) (on crate3 pallet2)
   added: (lifting hoist2 crate3) (clear pallet2)
   changed: (fuel-cost) from 35 to 36
   goals met: 3 of 6
23. (load hoist2 crate3 truck1 distributor1)
   deleted: (lifting hoist2 crate3)
   added: (in crate3 truck1) (available hoist2)
   changed: (current_load truck1) from 73 to 160
   goals met: 3 of 6
24. (unload hoist2 crate5 truck1 distributor1)
   deleted: (in crate5 truck1) (available hoist2)
   added: (lifting hoist2 crate5)
   changed: (current_load truck1) from 160 to 149
   goals met: 3 of 6
25. (drop hoist2 crate5 pallet2 distributor1)
   deleted: (lifting hoist2 crate5) (clear pallet2)
   added: (available hoist2) (at crate5 distributor1) (clear crate5) (on crate5 pallet2)
   goals met: 4 of 6
26. (unload hoist2 crate3 truck1 distributor1)
   deleted: (in crate3 truck1) (available hoist2)
   added: (lifting hoist2 crate3)
   changed: (current_load truck1) from 149 to 62
   goals met: 4 of 6
27. (drop hoist2 crate3 crate5 distributor1)
   deleted: (lifting hoist2 crate3) (clear crate5)
   added: (available hoist2) (at crate3 distributor1) (clear crate3) (on crate3 crate5)
   goals met: 5 of 6
28. (unload hoist2 crate4 truck1 distributor1)
   deleted: (in crate4 truck1) (available hoist2)
   added: (lifting hoist2 crate4)
   changed: (current_load truck1) from 62 to 0
   goals met: 5 of 6
29. (drop hoist2 crate4 crate3 distributor1)
   deleted: (lifting hoist2 crate4) (clear crate3)
   added: (available hoist2) (at crate4 distributor1) (clear crate4) (on crate4 crate3)
   goals met: 6 of 6
